Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 28, 28, 32)        320       
                                                                 
 batch_normalization (Batch  (None, 28, 28, 32)        128       
 Normalization)                                                  
                                                                 
 max_pooling2d (MaxPooling2  (None, 14, 14, 32)        0         
 D)                                                              
                                                                 
 conv2d_1 (Conv2D)           (None, 14, 14, 16)        4624      
                                                                 
 dropout (Dropout)           (None, 14, 14, 16)        0         
                                                                 
 batch_normalization_1 (Bat  (None, 14, 14, 16)        64        
 chNormalization)                                                
                                                                 
 max_pooling2d_1 (MaxPoolin  (None, 7, 7, 16)          0         
 g2D)                                                            
                                                                 
 conv2d_2 (Conv2D)           (None, 7, 7, 8)           1160      
                                                                 
 batch_normalization_2 (Bat  (None, 7, 7, 8)           32        
 chNormalization)                                                
                                                                 
 max_pooling2d_2 (MaxPoolin  (None, 4, 4, 8)           0         
 g2D)                                                            
                                                                 
 flatten (Flatten)           (None, 128)               0         
                                                                 
 dense (Dense)               (None, 128)               16512     
                                                                 
 dropout_1 (Dropout)         (None, 128)               0         
                                                                 
 dense_1 (Dense)             (None, 3)                 387       
                                                                 
=================================================================
Total params: 23227 (90.73 KB)
Trainable params: 23115 (90.29 KB)
Non-trainable params: 112 (448.00 Byte)
_________________________________________________________________
Epoch 1/10
 1/26 [>.............................] - ETA: 8s - loss: 1.2356 - accuracy: 0.2969 4/26 [===>..........................] - ETA: 0s - loss: 1.0961 - accuracy: 0.4219 7/26 [=======>......................] - ETA: 0s - loss: 1.0073 - accuracy: 0.500010/26 [==========>...................] - ETA: 0s - loss: 0.9347 - accuracy: 0.553113/26 [==============>...............] - ETA: 0s - loss: 0.8672 - accuracy: 0.596216/26 [=================>............] - ETA: 0s - loss: 0.8053 - accuracy: 0.633819/26 [====================>.........] - ETA: 0s - loss: 0.7481 - accuracy: 0.672322/26 [========================>.....] - ETA: 0s - loss: 0.6918 - accuracy: 0.706025/26 [===========================>..] - ETA: 0s - loss: 0.6508 - accuracy: 0.728426/26 [==============================] - 1s 28ms/step - loss: 0.6365 - accuracy: 0.7369 - val_loss: 0.9442 - val_accuracy: 0.8257
Epoch 2/10
 1/26 [>.............................] - ETA: 0s - loss: 0.2355 - accuracy: 0.9297 4/26 [===>..........................] - ETA: 0s - loss: 0.2144 - accuracy: 0.9492 7/26 [=======>......................] - ETA: 0s - loss: 0.2055 - accuracy: 0.947510/26 [==========>...................] - ETA: 0s - loss: 0.1932 - accuracy: 0.951613/26 [==============>...............] - ETA: 0s - loss: 0.1850 - accuracy: 0.953716/26 [=================>............] - ETA: 0s - loss: 0.1760 - accuracy: 0.955019/26 [====================>.........] - ETA: 0s - loss: 0.1644 - accuracy: 0.958522/26 [========================>.....] - ETA: 0s - loss: 0.1551 - accuracy: 0.961325/26 [===========================>..] - ETA: 0s - loss: 0.1463 - accuracy: 0.965126/26 [==============================] - 1s 24ms/step - loss: 0.1450 - accuracy: 0.9652 - val_loss: 0.8173 - val_accuracy: 0.7092
Epoch 3/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0800 - accuracy: 0.9766 4/26 [===>..........................] - ETA: 0s - loss: 0.0858 - accuracy: 0.9785 7/26 [=======>......................] - ETA: 0s - loss: 0.0776 - accuracy: 0.981110/26 [==========>...................] - ETA: 0s - loss: 0.0717 - accuracy: 0.983813/26 [==============>...............] - ETA: 0s - loss: 0.0695 - accuracy: 0.983916/26 [=================>............] - ETA: 0s - loss: 0.0693 - accuracy: 0.983019/26 [====================>.........] - ETA: 0s - loss: 0.0652 - accuracy: 0.984922/26 [========================>.....] - ETA: 0s - loss: 0.0629 - accuracy: 0.985525/26 [===========================>..] - ETA: 0s - loss: 0.0608 - accuracy: 0.986426/26 [==============================] - 1s 23ms/step - loss: 0.0593 - accuracy: 0.9869 - val_loss: 0.8854 - val_accuracy: 0.5284
Epoch 4/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0364 - accuracy: 0.9922 4/26 [===>..........................] - ETA: 0s - loss: 0.0422 - accuracy: 0.9883 7/26 [=======>......................] - ETA: 0s - loss: 0.0417 - accuracy: 0.991110/26 [==========>...................] - ETA: 0s - loss: 0.0373 - accuracy: 0.993713/26 [==============>...............] - ETA: 0s - loss: 0.0360 - accuracy: 0.993416/26 [=================>............] - ETA: 0s - loss: 0.0356 - accuracy: 0.993219/26 [====================>.........] - ETA: 0s - loss: 0.0344 - accuracy: 0.992622/26 [========================>.....] - ETA: 0s - loss: 0.0341 - accuracy: 0.992525/26 [===========================>..] - ETA: 0s - loss: 0.0346 - accuracy: 0.992726/26 [==============================] - 1s 23ms/step - loss: 0.0345 - accuracy: 0.9927 - val_loss: 1.0501 - val_accuracy: 0.4464
Epoch 5/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0347 - accuracy: 0.9922 4/26 [===>..........................] - ETA: 0s - loss: 0.0272 - accuracy: 0.9941 7/26 [=======>......................] - ETA: 0s - loss: 0.0288 - accuracy: 0.994410/26 [==========>...................] - ETA: 0s - loss: 0.0271 - accuracy: 0.994513/26 [==============>...............] - ETA: 0s - loss: 0.0270 - accuracy: 0.994016/26 [=================>............] - ETA: 0s - loss: 0.0267 - accuracy: 0.993719/26 [====================>.........] - ETA: 0s - loss: 0.0270 - accuracy: 0.993422/26 [========================>.....] - ETA: 0s - loss: 0.0270 - accuracy: 0.993625/26 [===========================>..] - ETA: 0s - loss: 0.0270 - accuracy: 0.993026/26 [==============================] - 1s 23ms/step - loss: 0.0266 - accuracy: 0.9930 - val_loss: 1.2080 - val_accuracy: 0.4380
Epoch 6/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0129 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0139 - accuracy: 1.0000 7/26 [=======>......................] - ETA: 0s - loss: 0.0255 - accuracy: 0.995510/26 [==========>...................] - ETA: 0s - loss: 0.0258 - accuracy: 0.995313/26 [==============>...............] - ETA: 0s - loss: 0.0255 - accuracy: 0.995216/26 [=================>............] - ETA: 0s - loss: 0.0252 - accuracy: 0.995119/26 [====================>.........] - ETA: 0s - loss: 0.0248 - accuracy: 0.995522/26 [========================>.....] - ETA: 0s - loss: 0.0229 - accuracy: 0.996125/26 [===========================>..] - ETA: 0s - loss: 0.0224 - accuracy: 0.996226/26 [==============================] - 1s 23ms/step - loss: 0.0224 - accuracy: 0.9960 - val_loss: 1.4008 - val_accuracy: 0.3840
Epoch 7/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0087 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0111 - accuracy: 1.0000 7/26 [=======>......................] - ETA: 0s - loss: 0.0150 - accuracy: 0.997810/26 [==========>...................] - ETA: 0s - loss: 0.0133 - accuracy: 0.998413/26 [==============>...............] - ETA: 0s - loss: 0.0137 - accuracy: 0.998216/26 [=================>............] - ETA: 0s - loss: 0.0131 - accuracy: 0.998519/26 [====================>.........] - ETA: 0s - loss: 0.0143 - accuracy: 0.998422/26 [========================>.....] - ETA: 0s - loss: 0.0155 - accuracy: 0.997225/26 [===========================>..] - ETA: 0s - loss: 0.0149 - accuracy: 0.997526/26 [==============================] - 1s 22ms/step - loss: 0.0147 - accuracy: 0.9976 - val_loss: 1.2223 - val_accuracy: 0.5172
Epoch 8/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0135 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0134 - accuracy: 0.9957 7/26 [=======>......................] - ETA: 0s - loss: 0.0126 - accuracy: 0.995310/26 [==========>...................] - ETA: 0s - loss: 0.0129 - accuracy: 0.995913/26 [==============>...............] - ETA: 0s - loss: 0.0133 - accuracy: 0.996316/26 [=================>............] - ETA: 0s - loss: 0.0116 - accuracy: 0.997019/26 [====================>.........] - ETA: 0s - loss: 0.0120 - accuracy: 0.997122/26 [========================>.....] - ETA: 0s - loss: 0.0119 - accuracy: 0.997525/26 [===========================>..] - ETA: 0s - loss: 0.0111 - accuracy: 0.997826/26 [==============================] - 1s 23ms/step - loss: 0.0108 - accuracy: 0.9979 - val_loss: 1.4505 - val_accuracy: 0.4576
Epoch 9/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0098 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0091 - accuracy: 1.0000 7/26 [=======>......................] - ETA: 0s - loss: 0.0082 - accuracy: 1.000010/26 [==========>...................] - ETA: 0s - loss: 0.0096 - accuracy: 1.000013/26 [==============>...............] - ETA: 0s - loss: 0.0092 - accuracy: 1.000016/26 [=================>............] - ETA: 0s - loss: 0.0089 - accuracy: 1.000019/26 [====================>.........] - ETA: 0s - loss: 0.0096 - accuracy: 0.999622/26 [========================>.....] - ETA: 0s - loss: 0.0100 - accuracy: 0.999325/26 [===========================>..] - ETA: 0s - loss: 0.0107 - accuracy: 0.999026/26 [==============================] - 1s 23ms/step - loss: 0.0108 - accuracy: 0.9988 - val_loss: 1.4395 - val_accuracy: 0.4315
Epoch 10/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0065 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0068 - accuracy: 1.0000 7/26 [=======>......................] - ETA: 0s - loss: 0.0112 - accuracy: 0.995510/26 [==========>...................] - ETA: 0s - loss: 0.0122 - accuracy: 0.995313/26 [==============>...............] - ETA: 0s - loss: 0.0108 - accuracy: 0.996316/26 [=================>............] - ETA: 0s - loss: 0.0113 - accuracy: 0.996019/26 [====================>.........] - ETA: 0s - loss: 0.0105 - accuracy: 0.996622/26 [========================>.....] - ETA: 0s - loss: 0.0101 - accuracy: 0.997125/26 [===========================>..] - ETA: 0s - loss: 0.0096 - accuracy: 0.997526/26 [==============================] - 1s 24ms/step - loss: 0.0096 - accuracy: 0.9976 - val_loss: 1.0511 - val_accuracy: 0.5368
 1/34 [..............................] - ETA: 1s24/34 [====================>.........] - ETA: 0s34/34 [==============================] - 0s 2ms/step
