Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 28, 28, 32)        320       
                                                                 
 batch_normalization (Batch  (None, 28, 28, 32)        128       
 Normalization)                                                  
                                                                 
 max_pooling2d (MaxPooling2  (None, 14, 14, 32)        0         
 D)                                                              
                                                                 
 conv2d_1 (Conv2D)           (None, 14, 14, 16)        4624      
                                                                 
 dropout (Dropout)           (None, 14, 14, 16)        0         
                                                                 
 batch_normalization_1 (Bat  (None, 14, 14, 16)        64        
 chNormalization)                                                
                                                                 
 max_pooling2d_1 (MaxPoolin  (None, 7, 7, 16)          0         
 g2D)                                                            
                                                                 
 conv2d_2 (Conv2D)           (None, 7, 7, 8)           1160      
                                                                 
 batch_normalization_2 (Bat  (None, 7, 7, 8)           32        
 chNormalization)                                                
                                                                 
 max_pooling2d_2 (MaxPoolin  (None, 4, 4, 8)           0         
 g2D)                                                            
                                                                 
 flatten (Flatten)           (None, 128)               0         
                                                                 
 dense (Dense)               (None, 128)               16512     
                                                                 
 dropout_1 (Dropout)         (None, 128)               0         
                                                                 
 dense_1 (Dense)             (None, 3)                 387       
                                                                 
=================================================================
Total params: 23227 (90.73 KB)
Trainable params: 23115 (90.29 KB)
Non-trainable params: 112 (448.00 Byte)
_________________________________________________________________
Epoch 1/10
 1/26 [>.............................] - ETA: 8s - loss: 1.4115 - accuracy: 0.3672 4/26 [===>..........................] - ETA: 0s - loss: 1.2710 - accuracy: 0.3516 7/26 [=======>......................] - ETA: 0s - loss: 1.1846 - accuracy: 0.395110/26 [==========>...................] - ETA: 0s - loss: 1.1455 - accuracy: 0.406713/26 [==============>...............] - ETA: 0s - loss: 1.0824 - accuracy: 0.449316/26 [=================>............] - ETA: 0s - loss: 1.0248 - accuracy: 0.492519/26 [====================>.........] - ETA: 0s - loss: 0.9788 - accuracy: 0.527322/26 [========================>.....] - ETA: 0s - loss: 0.9358 - accuracy: 0.556025/26 [===========================>..] - ETA: 0s - loss: 0.8981 - accuracy: 0.583126/26 [==============================] - 1s 26ms/step - loss: 0.8851 - accuracy: 0.5909 - val_loss: 1.1142 - val_accuracy: 0.2889
Epoch 2/10
 1/26 [>.............................] - ETA: 0s - loss: 0.4861 - accuracy: 0.8516 4/26 [===>..........................] - ETA: 0s - loss: 0.5151 - accuracy: 0.8340 7/26 [=======>......................] - ETA: 0s - loss: 0.4923 - accuracy: 0.843810/26 [==========>...................] - ETA: 0s - loss: 0.4749 - accuracy: 0.849213/26 [==============>...............] - ETA: 0s - loss: 0.4578 - accuracy: 0.854017/26 [==================>...........] - ETA: 0s - loss: 0.4416 - accuracy: 0.860020/26 [======================>.......] - ETA: 0s - loss: 0.4171 - accuracy: 0.871023/26 [=========================>....] - ETA: 0s - loss: 0.4041 - accuracy: 0.875726/26 [==============================] - ETA: 0s - loss: 0.3855 - accuracy: 0.882326/26 [==============================] - 1s 21ms/step - loss: 0.3855 - accuracy: 0.8823 - val_loss: 1.0990 - val_accuracy: 0.3085
Epoch 3/10
 1/26 [>.............................] - ETA: 0s - loss: 0.2855 - accuracy: 0.9141 4/26 [===>..........................] - ETA: 0s - loss: 0.2557 - accuracy: 0.9258 7/26 [=======>......................] - ETA: 0s - loss: 0.2470 - accuracy: 0.924111/26 [===========>..................] - ETA: 0s - loss: 0.2319 - accuracy: 0.930114/26 [===============>..............] - ETA: 0s - loss: 0.2132 - accuracy: 0.940917/26 [==================>...........] - ETA: 0s - loss: 0.2055 - accuracy: 0.943120/26 [======================>.......] - ETA: 0s - loss: 0.1949 - accuracy: 0.947523/26 [=========================>....] - ETA: 0s - loss: 0.1899 - accuracy: 0.949626/26 [==============================] - ETA: 0s - loss: 0.1824 - accuracy: 0.951826/26 [==============================] - 1s 21ms/step - loss: 0.1824 - accuracy: 0.9518 - val_loss: 1.0983 - val_accuracy: 0.3085
Epoch 4/10
 1/26 [>.............................] - ETA: 0s - loss: 0.1023 - accuracy: 0.9766 4/26 [===>..........................] - ETA: 0s - loss: 0.1056 - accuracy: 0.9805 8/26 [========>.....................] - ETA: 0s - loss: 0.1080 - accuracy: 0.979511/26 [===========>..................] - ETA: 0s - loss: 0.1030 - accuracy: 0.980914/26 [===============>..............] - ETA: 0s - loss: 0.0964 - accuracy: 0.982817/26 [==================>...........] - ETA: 0s - loss: 0.0925 - accuracy: 0.983120/26 [======================>.......] - ETA: 0s - loss: 0.0929 - accuracy: 0.983323/26 [=========================>....] - ETA: 0s - loss: 0.0900 - accuracy: 0.984126/26 [==============================] - ETA: 0s - loss: 0.0866 - accuracy: 0.985426/26 [==============================] - 1s 21ms/step - loss: 0.0866 - accuracy: 0.9854 - val_loss: 1.1125 - val_accuracy: 0.3085
Epoch 5/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0520 - accuracy: 0.9922 4/26 [===>..........................] - ETA: 0s - loss: 0.0617 - accuracy: 0.9883 7/26 [=======>......................] - ETA: 0s - loss: 0.0615 - accuracy: 0.990011/26 [===========>..................] - ETA: 0s - loss: 0.0606 - accuracy: 0.991214/26 [===============>..............] - ETA: 0s - loss: 0.0576 - accuracy: 0.993117/26 [==================>...........] - ETA: 0s - loss: 0.0596 - accuracy: 0.991120/26 [======================>.......] - ETA: 0s - loss: 0.0580 - accuracy: 0.991223/26 [=========================>....] - ETA: 0s - loss: 0.0573 - accuracy: 0.991426/26 [==============================] - ETA: 0s - loss: 0.0564 - accuracy: 0.991526/26 [==============================] - 1s 21ms/step - loss: 0.0564 - accuracy: 0.9915 - val_loss: 1.0917 - val_accuracy: 0.3085
Epoch 6/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0368 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0416 - accuracy: 0.9961 7/26 [=======>......................] - ETA: 0s - loss: 0.0465 - accuracy: 0.992210/26 [==========>...................] - ETA: 0s - loss: 0.0461 - accuracy: 0.993012/26 [============>.................] - ETA: 0s - loss: 0.0479 - accuracy: 0.991515/26 [================>.............] - ETA: 0s - loss: 0.0475 - accuracy: 0.991718/26 [===================>..........] - ETA: 0s - loss: 0.0457 - accuracy: 0.992621/26 [=======================>......] - ETA: 0s - loss: 0.0452 - accuracy: 0.992225/26 [===========================>..] - ETA: 0s - loss: 0.0423 - accuracy: 0.993326/26 [==============================] - 1s 23ms/step - loss: 0.0415 - accuracy: 0.9933 - val_loss: 1.0435 - val_accuracy: 0.3113
Epoch 7/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0306 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0347 - accuracy: 0.9941 7/26 [=======>......................] - ETA: 0s - loss: 0.0329 - accuracy: 0.995510/26 [==========>...................] - ETA: 0s - loss: 0.0305 - accuracy: 0.996113/26 [==============>...............] - ETA: 0s - loss: 0.0294 - accuracy: 0.996416/26 [=================>............] - ETA: 0s - loss: 0.0279 - accuracy: 0.997119/26 [====================>.........] - ETA: 0s - loss: 0.0271 - accuracy: 0.997122/26 [========================>.....] - ETA: 0s - loss: 0.0264 - accuracy: 0.997225/26 [===========================>..] - ETA: 0s - loss: 0.0267 - accuracy: 0.996626/26 [==============================] - 1s 22ms/step - loss: 0.0266 - accuracy: 0.9966 - val_loss: 0.9856 - val_accuracy: 0.6682
Epoch 8/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0255 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0207 - accuracy: 1.0000 7/26 [=======>......................] - ETA: 0s - loss: 0.0205 - accuracy: 0.997810/26 [==========>...................] - ETA: 0s - loss: 0.0202 - accuracy: 0.997713/26 [==============>...............] - ETA: 0s - loss: 0.0213 - accuracy: 0.996916/26 [=================>............] - ETA: 0s - loss: 0.0215 - accuracy: 0.996519/26 [====================>.........] - ETA: 0s - loss: 0.0208 - accuracy: 0.996622/26 [========================>.....] - ETA: 0s - loss: 0.0201 - accuracy: 0.997125/26 [===========================>..] - ETA: 0s - loss: 0.0201 - accuracy: 0.997126/26 [==============================] - 1s 21ms/step - loss: 0.0200 - accuracy: 0.9973 - val_loss: 0.9269 - val_accuracy: 0.4119
Epoch 9/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0162 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0207 - accuracy: 0.9961 7/26 [=======>......................] - ETA: 0s - loss: 0.0207 - accuracy: 0.994410/26 [==========>...................] - ETA: 0s - loss: 0.0177 - accuracy: 0.996113/26 [==============>...............] - ETA: 0s - loss: 0.0174 - accuracy: 0.995216/26 [=================>............] - ETA: 0s - loss: 0.0167 - accuracy: 0.996119/26 [====================>.........] - ETA: 0s - loss: 0.0165 - accuracy: 0.996322/26 [========================>.....] - ETA: 0s - loss: 0.0165 - accuracy: 0.996125/26 [===========================>..] - ETA: 0s - loss: 0.0174 - accuracy: 0.995926/26 [==============================] - 1s 22ms/step - loss: 0.0172 - accuracy: 0.9960 - val_loss: 0.8989 - val_accuracy: 0.4026
Epoch 10/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0124 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0192 - accuracy: 0.9957 7/26 [=======>......................] - ETA: 0s - loss: 0.0172 - accuracy: 0.996510/26 [==========>...................] - ETA: 0s - loss: 0.0160 - accuracy: 0.997613/26 [==============>...............] - ETA: 0s - loss: 0.0151 - accuracy: 0.998116/26 [=================>............] - ETA: 0s - loss: 0.0140 - accuracy: 0.998519/26 [====================>.........] - ETA: 0s - loss: 0.0141 - accuracy: 0.998322/26 [========================>.....] - ETA: 0s - loss: 0.0141 - accuracy: 0.998225/26 [===========================>..] - ETA: 0s - loss: 0.0144 - accuracy: 0.997826/26 [==============================] - 1s 22ms/step - loss: 0.0142 - accuracy: 0.9979 - val_loss: 0.9030 - val_accuracy: 0.4026
 1/34 [..............................] - ETA: 1s26/34 [=====================>........] - ETA: 0s34/34 [==============================] - 0s 2ms/step
