Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 28, 28, 32)        320       
                                                                 
 batch_normalization (Batch  (None, 28, 28, 32)        128       
 Normalization)                                                  
                                                                 
 max_pooling2d (MaxPooling2  (None, 14, 14, 32)        0         
 D)                                                              
                                                                 
 conv2d_1 (Conv2D)           (None, 14, 14, 16)        4624      
                                                                 
 dropout (Dropout)           (None, 14, 14, 16)        0         
                                                                 
 batch_normalization_1 (Bat  (None, 14, 14, 16)        64        
 chNormalization)                                                
                                                                 
 max_pooling2d_1 (MaxPoolin  (None, 7, 7, 16)          0         
 g2D)                                                            
                                                                 
 conv2d_2 (Conv2D)           (None, 7, 7, 8)           1160      
                                                                 
 batch_normalization_2 (Bat  (None, 7, 7, 8)           32        
 chNormalization)                                                
                                                                 
 max_pooling2d_2 (MaxPoolin  (None, 4, 4, 8)           0         
 g2D)                                                            
                                                                 
 flatten (Flatten)           (None, 128)               0         
                                                                 
 dense (Dense)               (None, 128)               16512     
                                                                 
 dropout_1 (Dropout)         (None, 128)               0         
                                                                 
 dense_1 (Dense)             (None, 3)                 387       
                                                                 
=================================================================
Total params: 23227 (90.73 KB)
Trainable params: 23115 (90.29 KB)
Non-trainable params: 112 (448.00 Byte)
_________________________________________________________________
Epoch 1/10
 1/26 [>.............................] - ETA: 8s - loss: 2.7440 - accuracy: 0.3438 4/26 [===>..........................] - ETA: 0s - loss: 1.8225 - accuracy: 0.3848 7/26 [=======>......................] - ETA: 0s - loss: 1.5541 - accuracy: 0.444210/26 [==========>...................] - ETA: 0s - loss: 1.3105 - accuracy: 0.510913/26 [==============>...............] - ETA: 0s - loss: 1.1801 - accuracy: 0.548716/26 [=================>............] - ETA: 0s - loss: 1.0434 - accuracy: 0.595719/26 [====================>.........] - ETA: 0s - loss: 0.9425 - accuracy: 0.636522/26 [========================>.....] - ETA: 0s - loss: 0.8733 - accuracy: 0.661825/26 [===========================>..] - ETA: 0s - loss: 0.8030 - accuracy: 0.689426/26 [==============================] - 1s 29ms/step - loss: 0.7806 - accuracy: 0.6979 - val_loss: 0.7282 - val_accuracy: 0.7307
Epoch 2/10
 1/26 [>.............................] - ETA: 0s - loss: 0.2714 - accuracy: 0.9125 4/26 [===>..........................] - ETA: 0s - loss: 0.2779 - accuracy: 0.8944 7/26 [=======>......................] - ETA: 0s - loss: 0.2577 - accuracy: 0.900910/26 [==========>...................] - ETA: 0s - loss: 0.2431 - accuracy: 0.905013/26 [==============>...............] - ETA: 0s - loss: 0.2252 - accuracy: 0.912716/26 [=================>............] - ETA: 0s - loss: 0.2070 - accuracy: 0.920019/26 [====================>.........] - ETA: 0s - loss: 0.1970 - accuracy: 0.925822/26 [========================>.....] - ETA: 0s - loss: 0.1812 - accuracy: 0.933225/26 [===========================>..] - ETA: 0s - loss: 0.1714 - accuracy: 0.936526/26 [==============================] - 1s 26ms/step - loss: 0.1676 - accuracy: 0.9378 - val_loss: 0.6583 - val_accuracy: 0.5834
Epoch 3/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0652 - accuracy: 0.9922 4/26 [===>..........................] - ETA: 0s - loss: 0.1154 - accuracy: 0.9648 7/26 [=======>......................] - ETA: 0s - loss: 0.1032 - accuracy: 0.967010/26 [==========>...................] - ETA: 0s - loss: 0.0892 - accuracy: 0.972413/26 [==============>...............] - ETA: 0s - loss: 0.0853 - accuracy: 0.974616/26 [=================>............] - ETA: 0s - loss: 0.0782 - accuracy: 0.977019/26 [====================>.........] - ETA: 0s - loss: 0.0734 - accuracy: 0.979022/26 [========================>.....] - ETA: 0s - loss: 0.0740 - accuracy: 0.977225/26 [===========================>..] - ETA: 0s - loss: 0.0721 - accuracy: 0.978126/26 [==============================] - 1s 25ms/step - loss: 0.0728 - accuracy: 0.9777 - val_loss: 0.6441 - val_accuracy: 0.5126
Epoch 4/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0598 - accuracy: 0.9922 4/26 [===>..........................] - ETA: 0s - loss: 0.0605 - accuracy: 0.9844 7/26 [=======>......................] - ETA: 0s - loss: 0.0529 - accuracy: 0.983310/26 [==========>...................] - ETA: 0s - loss: 0.0504 - accuracy: 0.983613/26 [==============>...............] - ETA: 0s - loss: 0.0484 - accuracy: 0.984416/26 [=================>............] - ETA: 0s - loss: 0.0480 - accuracy: 0.984419/26 [====================>.........] - ETA: 0s - loss: 0.0466 - accuracy: 0.986022/26 [========================>.....] - ETA: 0s - loss: 0.0454 - accuracy: 0.986925/26 [===========================>..] - ETA: 0s - loss: 0.0453 - accuracy: 0.986026/26 [==============================] - 1s 24ms/step - loss: 0.0458 - accuracy: 0.9854 - val_loss: 0.6007 - val_accuracy: 0.5722
Epoch 5/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0804 - accuracy: 0.9609 4/26 [===>..........................] - ETA: 0s - loss: 0.0441 - accuracy: 0.9824 7/26 [=======>......................] - ETA: 0s - loss: 0.0339 - accuracy: 0.990010/26 [==========>...................] - ETA: 0s - loss: 0.0342 - accuracy: 0.989113/26 [==============>...............] - ETA: 0s - loss: 0.0333 - accuracy: 0.988616/26 [=================>............] - ETA: 0s - loss: 0.0312 - accuracy: 0.989319/26 [====================>.........] - ETA: 0s - loss: 0.0313 - accuracy: 0.989122/26 [========================>.....] - ETA: 0s - loss: 0.0316 - accuracy: 0.988825/26 [===========================>..] - ETA: 0s - loss: 0.0329 - accuracy: 0.988926/26 [==============================] - 1s 24ms/step - loss: 0.0325 - accuracy: 0.9890 - val_loss: 0.6341 - val_accuracy: 0.5750
Epoch 6/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0234 - accuracy: 0.9922 4/26 [===>..........................] - ETA: 0s - loss: 0.0216 - accuracy: 0.9961 7/26 [=======>......................] - ETA: 0s - loss: 0.0240 - accuracy: 0.994410/26 [==========>...................] - ETA: 0s - loss: 0.0241 - accuracy: 0.994513/26 [==============>...............] - ETA: 0s - loss: 0.0227 - accuracy: 0.995716/26 [=================>............] - ETA: 0s - loss: 0.0229 - accuracy: 0.995519/26 [====================>.........] - ETA: 0s - loss: 0.0250 - accuracy: 0.994522/26 [========================>.....] - ETA: 0s - loss: 0.0235 - accuracy: 0.994925/26 [===========================>..] - ETA: 0s - loss: 0.0231 - accuracy: 0.994926/26 [==============================] - 1s 25ms/step - loss: 0.0249 - accuracy: 0.9942 - val_loss: 0.6705 - val_accuracy: 0.5955
Epoch 7/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0300 - accuracy: 0.9922 4/26 [===>..........................] - ETA: 0s - loss: 0.0172 - accuracy: 0.9978 7/26 [=======>......................] - ETA: 0s - loss: 0.0217 - accuracy: 0.994110/26 [==========>...................] - ETA: 0s - loss: 0.0194 - accuracy: 0.995113/26 [==============>...............] - ETA: 0s - loss: 0.0176 - accuracy: 0.995716/26 [=================>............] - ETA: 0s - loss: 0.0176 - accuracy: 0.995019/26 [====================>.........] - ETA: 0s - loss: 0.0184 - accuracy: 0.994522/26 [========================>.....] - ETA: 0s - loss: 0.0184 - accuracy: 0.994925/26 [===========================>..] - ETA: 0s - loss: 0.0179 - accuracy: 0.994926/26 [==============================] - 1s 26ms/step - loss: 0.0177 - accuracy: 0.9951 - val_loss: 0.5862 - val_accuracy: 0.6598
Epoch 8/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0136 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0111 - accuracy: 1.0000 7/26 [=======>......................] - ETA: 0s - loss: 0.0101 - accuracy: 1.000010/26 [==========>...................] - ETA: 0s - loss: 0.0117 - accuracy: 0.999213/26 [==============>...............] - ETA: 0s - loss: 0.0120 - accuracy: 0.999416/26 [=================>............] - ETA: 0s - loss: 0.0115 - accuracy: 0.999019/26 [====================>.........] - ETA: 0s - loss: 0.0119 - accuracy: 0.998322/26 [========================>.....] - ETA: 0s - loss: 0.0121 - accuracy: 0.997825/26 [===========================>..] - ETA: 0s - loss: 0.0126 - accuracy: 0.997826/26 [==============================] - 1s 26ms/step - loss: 0.0130 - accuracy: 0.9976 - val_loss: 0.4345 - val_accuracy: 0.7530
Epoch 9/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0078 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0084 - accuracy: 0.9978 7/26 [=======>......................] - ETA: 0s - loss: 0.0098 - accuracy: 0.997610/26 [==========>...................] - ETA: 0s - loss: 0.0091 - accuracy: 0.998413/26 [==============>...............] - ETA: 0s - loss: 0.0106 - accuracy: 0.996916/26 [=================>............] - ETA: 0s - loss: 0.0110 - accuracy: 0.997019/26 [====================>.........] - ETA: 0s - loss: 0.0112 - accuracy: 0.997122/26 [========================>.....] - ETA: 0s - loss: 0.0107 - accuracy: 0.997525/26 [===========================>..] - ETA: 0s - loss: 0.0100 - accuracy: 0.997826/26 [==============================] - 1s 26ms/step - loss: 0.0098 - accuracy: 0.9979 - val_loss: 0.3399 - val_accuracy: 0.8276
Epoch 10/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0204 - accuracy: 0.9922 4/26 [===>..........................] - ETA: 0s - loss: 0.0122 - accuracy: 0.9961 7/26 [=======>......................] - ETA: 0s - loss: 0.0133 - accuracy: 0.995510/26 [==========>...................] - ETA: 0s - loss: 0.0139 - accuracy: 0.995313/26 [==============>...............] - ETA: 0s - loss: 0.0130 - accuracy: 0.995816/26 [=================>............] - ETA: 0s - loss: 0.0120 - accuracy: 0.996119/26 [====================>.........] - ETA: 0s - loss: 0.0113 - accuracy: 0.996622/26 [========================>.....] - ETA: 0s - loss: 0.0106 - accuracy: 0.996725/26 [===========================>..] - ETA: 0s - loss: 0.0105 - accuracy: 0.996826/26 [==============================] - 1s 25ms/step - loss: 0.0105 - accuracy: 0.9970 - val_loss: 0.1985 - val_accuracy: 0.9264
 1/34 [..............................] - ETA: 1s22/34 [==================>...........] - ETA: 0s34/34 [==============================] - 0s 2ms/step
