Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 28, 28, 32)        320       
                                                                 
 batch_normalization (Batch  (None, 28, 28, 32)        128       
 Normalization)                                                  
                                                                 
 max_pooling2d (MaxPooling2  (None, 14, 14, 32)        0         
 D)                                                              
                                                                 
 conv2d_1 (Conv2D)           (None, 14, 14, 16)        4624      
                                                                 
 dropout (Dropout)           (None, 14, 14, 16)        0         
                                                                 
 batch_normalization_1 (Bat  (None, 14, 14, 16)        64        
 chNormalization)                                                
                                                                 
 max_pooling2d_1 (MaxPoolin  (None, 7, 7, 16)          0         
 g2D)                                                            
                                                                 
 conv2d_2 (Conv2D)           (None, 7, 7, 8)           1160      
                                                                 
 batch_normalization_2 (Bat  (None, 7, 7, 8)           32        
 chNormalization)                                                
                                                                 
 max_pooling2d_2 (MaxPoolin  (None, 4, 4, 8)           0         
 g2D)                                                            
                                                                 
 flatten (Flatten)           (None, 128)               0         
                                                                 
 dense (Dense)               (None, 128)               16512     
                                                                 
 dropout_1 (Dropout)         (None, 128)               0         
                                                                 
 dense_1 (Dense)             (None, 3)                 387       
                                                                 
=================================================================
Total params: 23227 (90.73 KB)
Trainable params: 23115 (90.29 KB)
Non-trainable params: 112 (448.00 Byte)
_________________________________________________________________
Epoch 1/10
 1/26 [>.............................] - ETA: 8s - loss: 1.9661 - accuracy: 0.2656 4/26 [===>..........................] - ETA: 0s - loss: 1.3437 - accuracy: 0.4551 7/26 [=======>......................] - ETA: 0s - loss: 1.0883 - accuracy: 0.558010/26 [==========>...................] - ETA: 0s - loss: 0.9566 - accuracy: 0.608013/26 [==============>...............] - ETA: 0s - loss: 0.8455 - accuracy: 0.651616/26 [=================>............] - ETA: 0s - loss: 0.7490 - accuracy: 0.693519/26 [====================>.........] - ETA: 0s - loss: 0.6798 - accuracy: 0.724422/26 [========================>.....] - ETA: 0s - loss: 0.6160 - accuracy: 0.751825/26 [===========================>..] - ETA: 0s - loss: 0.5728 - accuracy: 0.771626/26 [==============================] - 1s 27ms/step - loss: 0.5590 - accuracy: 0.7771 - val_loss: 1.0031 - val_accuracy: 0.4026
Epoch 2/10
 1/26 [>.............................] - ETA: 0s - loss: 0.1292 - accuracy: 0.9609 4/26 [===>..........................] - ETA: 0s - loss: 0.1692 - accuracy: 0.9355 7/26 [=======>......................] - ETA: 0s - loss: 0.1515 - accuracy: 0.946410/26 [==========>...................] - ETA: 0s - loss: 0.1451 - accuracy: 0.947713/26 [==============>...............] - ETA: 0s - loss: 0.1387 - accuracy: 0.951316/26 [=================>............] - ETA: 0s - loss: 0.1306 - accuracy: 0.954619/26 [====================>.........] - ETA: 0s - loss: 0.1244 - accuracy: 0.958122/26 [========================>.....] - ETA: 0s - loss: 0.1184 - accuracy: 0.959925/26 [===========================>..] - ETA: 0s - loss: 0.1147 - accuracy: 0.961026/26 [==============================] - 1s 23ms/step - loss: 0.1129 - accuracy: 0.9622 - val_loss: 1.4226 - val_accuracy: 0.4026
Epoch 3/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0320 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0431 - accuracy: 0.9902 7/26 [=======>......................] - ETA: 0s - loss: 0.0525 - accuracy: 0.983310/26 [==========>...................] - ETA: 0s - loss: 0.0540 - accuracy: 0.984413/26 [==============>...............] - ETA: 0s - loss: 0.0530 - accuracy: 0.986216/26 [=================>............] - ETA: 0s - loss: 0.0547 - accuracy: 0.984419/26 [====================>.........] - ETA: 0s - loss: 0.0507 - accuracy: 0.986022/26 [========================>.....] - ETA: 0s - loss: 0.0477 - accuracy: 0.987625/26 [===========================>..] - ETA: 0s - loss: 0.0455 - accuracy: 0.988426/26 [==============================] - 1s 22ms/step - loss: 0.0446 - accuracy: 0.9887 - val_loss: 1.8549 - val_accuracy: 0.4026
Epoch 4/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0191 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0326 - accuracy: 0.9922 7/26 [=======>......................] - ETA: 0s - loss: 0.0333 - accuracy: 0.992910/26 [==========>...................] - ETA: 0s - loss: 0.0382 - accuracy: 0.990313/26 [==============>...............] - ETA: 0s - loss: 0.0386 - accuracy: 0.990116/26 [=================>............] - ETA: 0s - loss: 0.0381 - accuracy: 0.990019/26 [====================>.........] - ETA: 0s - loss: 0.0356 - accuracy: 0.991222/26 [========================>.....] - ETA: 0s - loss: 0.0347 - accuracy: 0.991325/26 [===========================>..] - ETA: 0s - loss: 0.0334 - accuracy: 0.991126/26 [==============================] - 1s 22ms/step - loss: 0.0328 - accuracy: 0.9915 - val_loss: 2.2228 - val_accuracy: 0.4026
Epoch 5/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0314 - accuracy: 0.9922 4/26 [===>..........................] - ETA: 0s - loss: 0.0193 - accuracy: 0.9980 7/26 [=======>......................] - ETA: 0s - loss: 0.0268 - accuracy: 0.995510/26 [==========>...................] - ETA: 0s - loss: 0.0250 - accuracy: 0.996113/26 [==============>...............] - ETA: 0s - loss: 0.0226 - accuracy: 0.996916/26 [=================>............] - ETA: 0s - loss: 0.0210 - accuracy: 0.997019/26 [====================>.........] - ETA: 0s - loss: 0.0205 - accuracy: 0.997122/26 [========================>.....] - ETA: 0s - loss: 0.0203 - accuracy: 0.996425/26 [===========================>..] - ETA: 0s - loss: 0.0202 - accuracy: 0.996526/26 [==============================] - 1s 23ms/step - loss: 0.0199 - accuracy: 0.9966 - val_loss: 2.4131 - val_accuracy: 0.4026
Epoch 6/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0155 - accuracy: 0.9922 4/26 [===>..........................] - ETA: 0s - loss: 0.0272 - accuracy: 0.9902 7/26 [=======>......................] - ETA: 0s - loss: 0.0225 - accuracy: 0.992210/26 [==========>...................] - ETA: 0s - loss: 0.0201 - accuracy: 0.993713/26 [==============>...............] - ETA: 0s - loss: 0.0188 - accuracy: 0.994616/26 [=================>............] - ETA: 0s - loss: 0.0177 - accuracy: 0.995119/26 [====================>.........] - ETA: 0s - loss: 0.0172 - accuracy: 0.995122/26 [========================>.....] - ETA: 0s - loss: 0.0174 - accuracy: 0.994625/26 [===========================>..] - ETA: 0s - loss: 0.0178 - accuracy: 0.994626/26 [==============================] - 1s 23ms/step - loss: 0.0172 - accuracy: 0.9948 - val_loss: 2.3931 - val_accuracy: 0.4026
Epoch 7/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0108 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0111 - accuracy: 0.9961 7/26 [=======>......................] - ETA: 0s - loss: 0.0119 - accuracy: 0.995510/26 [==========>...................] - ETA: 0s - loss: 0.0143 - accuracy: 0.995113/26 [==============>...............] - ETA: 0s - loss: 0.0143 - accuracy: 0.995716/26 [=================>............] - ETA: 0s - loss: 0.0144 - accuracy: 0.995519/26 [====================>.........] - ETA: 0s - loss: 0.0153 - accuracy: 0.995022/26 [========================>.....] - ETA: 0s - loss: 0.0151 - accuracy: 0.994925/26 [===========================>..] - ETA: 0s - loss: 0.0140 - accuracy: 0.995626/26 [==============================] - 1s 23ms/step - loss: 0.0144 - accuracy: 0.9954 - val_loss: 2.3203 - val_accuracy: 0.4026
Epoch 8/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0017 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0122 - accuracy: 0.9961 7/26 [=======>......................] - ETA: 0s - loss: 0.0193 - accuracy: 0.995510/26 [==========>...................] - ETA: 0s - loss: 0.0174 - accuracy: 0.995113/26 [==============>...............] - ETA: 0s - loss: 0.0176 - accuracy: 0.995016/26 [=================>............] - ETA: 0s - loss: 0.0163 - accuracy: 0.995519/26 [====================>.........] - ETA: 0s - loss: 0.0155 - accuracy: 0.995822/26 [========================>.....] - ETA: 0s - loss: 0.0149 - accuracy: 0.996425/26 [===========================>..] - ETA: 0s - loss: 0.0140 - accuracy: 0.996826/26 [==============================] - 1s 23ms/step - loss: 0.0145 - accuracy: 0.9963 - val_loss: 1.6570 - val_accuracy: 0.4408
Epoch 9/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0256 - accuracy: 0.9922 4/26 [===>..........................] - ETA: 0s - loss: 0.0140 - accuracy: 0.9961 7/26 [=======>......................] - ETA: 0s - loss: 0.0098 - accuracy: 0.997810/26 [==========>...................] - ETA: 0s - loss: 0.0085 - accuracy: 0.998413/26 [==============>...............] - ETA: 0s - loss: 0.0081 - accuracy: 0.998816/26 [=================>............] - ETA: 0s - loss: 0.0076 - accuracy: 0.999019/26 [====================>.........] - ETA: 0s - loss: 0.0081 - accuracy: 0.998322/26 [========================>.....] - ETA: 0s - loss: 0.0076 - accuracy: 0.998625/26 [===========================>..] - ETA: 0s - loss: 0.0070 - accuracy: 0.998726/26 [==============================] - 1s 23ms/step - loss: 0.0069 - accuracy: 0.9988 - val_loss: 1.4317 - val_accuracy: 0.4921
Epoch 10/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0031 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0070 - accuracy: 0.9980 7/26 [=======>......................] - ETA: 0s - loss: 0.0078 - accuracy: 0.998910/26 [==========>...................] - ETA: 0s - loss: 0.0075 - accuracy: 0.999213/26 [==============>...............] - ETA: 0s - loss: 0.0061 - accuracy: 0.999416/26 [=================>............] - ETA: 0s - loss: 0.0062 - accuracy: 0.999019/26 [====================>.........] - ETA: 0s - loss: 0.0057 - accuracy: 0.999222/26 [========================>.....] - ETA: 0s - loss: 0.0057 - accuracy: 0.999325/26 [===========================>..] - ETA: 0s - loss: 0.0054 - accuracy: 0.999426/26 [==============================] - 1s 23ms/step - loss: 0.0055 - accuracy: 0.9994 - val_loss: 1.3407 - val_accuracy: 0.5200
 1/34 [..............................] - ETA: 1s24/34 [====================>.........] - ETA: 0s34/34 [==============================] - 0s 2ms/step
