Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 28, 28, 32)        320       
                                                                 
 batch_normalization (Batch  (None, 28, 28, 32)        128       
 Normalization)                                                  
                                                                 
 max_pooling2d (MaxPooling2  (None, 14, 14, 32)        0         
 D)                                                              
                                                                 
 conv2d_1 (Conv2D)           (None, 14, 14, 16)        4624      
                                                                 
 dropout (Dropout)           (None, 14, 14, 16)        0         
                                                                 
 batch_normalization_1 (Bat  (None, 14, 14, 16)        64        
 chNormalization)                                                
                                                                 
 max_pooling2d_1 (MaxPoolin  (None, 7, 7, 16)          0         
 g2D)                                                            
                                                                 
 conv2d_2 (Conv2D)           (None, 7, 7, 8)           1160      
                                                                 
 batch_normalization_2 (Bat  (None, 7, 7, 8)           32        
 chNormalization)                                                
                                                                 
 max_pooling2d_2 (MaxPoolin  (None, 4, 4, 8)           0         
 g2D)                                                            
                                                                 
 flatten (Flatten)           (None, 128)               0         
                                                                 
 dense (Dense)               (None, 128)               16512     
                                                                 
 dropout_1 (Dropout)         (None, 128)               0         
                                                                 
 dense_1 (Dense)             (None, 3)                 387       
                                                                 
=================================================================
Total params: 23227 (90.73 KB)
Trainable params: 23115 (90.29 KB)
Non-trainable params: 112 (448.00 Byte)
_________________________________________________________________
Epoch 1/10
 1/26 [>.............................] - ETA: 8s - loss: 1.1978 - accuracy: 0.3516 4/26 [===>..........................] - ETA: 0s - loss: 1.0611 - accuracy: 0.4805 7/26 [=======>......................] - ETA: 0s - loss: 0.9027 - accuracy: 0.583710/26 [==========>...................] - ETA: 0s - loss: 0.8008 - accuracy: 0.642213/26 [==============>...............] - ETA: 0s - loss: 0.7289 - accuracy: 0.676116/26 [=================>............] - ETA: 0s - loss: 0.6575 - accuracy: 0.715319/26 [====================>.........] - ETA: 0s - loss: 0.5935 - accuracy: 0.747922/26 [========================>.....] - ETA: 0s - loss: 0.5400 - accuracy: 0.774926/26 [==============================] - ETA: 0s - loss: 0.4878 - accuracy: 0.800926/26 [==============================] - 1s 25ms/step - loss: 0.4878 - accuracy: 0.8009 - val_loss: 0.8157 - val_accuracy: 0.4492
Epoch 2/10
 1/26 [>.............................] - ETA: 0s - loss: 0.1437 - accuracy: 0.9609 4/26 [===>..........................] - ETA: 0s - loss: 0.1454 - accuracy: 0.9570 7/26 [=======>......................] - ETA: 0s - loss: 0.1432 - accuracy: 0.956510/26 [==========>...................] - ETA: 0s - loss: 0.1313 - accuracy: 0.962513/26 [==============>...............] - ETA: 0s - loss: 0.1180 - accuracy: 0.966916/26 [=================>............] - ETA: 0s - loss: 0.1106 - accuracy: 0.970220/26 [======================>.......] - ETA: 0s - loss: 0.1051 - accuracy: 0.971323/26 [=========================>....] - ETA: 0s - loss: 0.0983 - accuracy: 0.973126/26 [==============================] - ETA: 0s - loss: 0.0948 - accuracy: 0.973826/26 [==============================] - 1s 21ms/step - loss: 0.0948 - accuracy: 0.9738 - val_loss: 0.8132 - val_accuracy: 0.5564
Epoch 3/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0559 - accuracy: 0.9844 4/26 [===>..........................] - ETA: 0s - loss: 0.0564 - accuracy: 0.9844 7/26 [=======>......................] - ETA: 0s - loss: 0.0508 - accuracy: 0.983510/26 [==========>...................] - ETA: 0s - loss: 0.0481 - accuracy: 0.985413/26 [==============>...............] - ETA: 0s - loss: 0.0462 - accuracy: 0.987016/26 [=================>............] - ETA: 0s - loss: 0.0431 - accuracy: 0.988519/26 [====================>.........] - ETA: 0s - loss: 0.0412 - accuracy: 0.989922/26 [========================>.....] - ETA: 0s - loss: 0.0411 - accuracy: 0.989225/26 [===========================>..] - ETA: 0s - loss: 0.0410 - accuracy: 0.988926/26 [==============================] - 1s 20ms/step - loss: 0.0411 - accuracy: 0.9893 - val_loss: 0.7353 - val_accuracy: 0.6925
Epoch 4/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0212 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0404 - accuracy: 0.9844 7/26 [=======>......................] - ETA: 0s - loss: 0.0318 - accuracy: 0.990010/26 [==========>...................] - ETA: 0s - loss: 0.0345 - accuracy: 0.990613/26 [==============>...............] - ETA: 0s - loss: 0.0346 - accuracy: 0.991016/26 [=================>............] - ETA: 0s - loss: 0.0313 - accuracy: 0.992719/26 [====================>.........] - ETA: 0s - loss: 0.0300 - accuracy: 0.993423/26 [=========================>....] - ETA: 0s - loss: 0.0294 - accuracy: 0.993426/26 [==============================] - ETA: 0s - loss: 0.0283 - accuracy: 0.993626/26 [==============================] - 1s 21ms/step - loss: 0.0283 - accuracy: 0.9936 - val_loss: 0.8990 - val_accuracy: 0.6915
Epoch 5/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0171 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0169 - accuracy: 0.9961 7/26 [=======>......................] - ETA: 0s - loss: 0.0168 - accuracy: 0.996710/26 [==========>...................] - ETA: 0s - loss: 0.0173 - accuracy: 0.995313/26 [==============>...............] - ETA: 0s - loss: 0.0163 - accuracy: 0.995816/26 [=================>............] - ETA: 0s - loss: 0.0162 - accuracy: 0.996119/26 [====================>.........] - ETA: 0s - loss: 0.0164 - accuracy: 0.995922/26 [========================>.....] - ETA: 0s - loss: 0.0165 - accuracy: 0.996125/26 [===========================>..] - ETA: 0s - loss: 0.0162 - accuracy: 0.995926/26 [==============================] - 1s 21ms/step - loss: 0.0160 - accuracy: 0.9960 - val_loss: 0.7620 - val_accuracy: 0.6934
Epoch 6/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0064 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0084 - accuracy: 1.0000 7/26 [=======>......................] - ETA: 0s - loss: 0.0084 - accuracy: 1.000010/26 [==========>...................] - ETA: 0s - loss: 0.0085 - accuracy: 0.999213/26 [==============>...............] - ETA: 0s - loss: 0.0090 - accuracy: 0.999416/26 [=================>............] - ETA: 0s - loss: 0.0094 - accuracy: 0.999019/26 [====================>.........] - ETA: 0s - loss: 0.0120 - accuracy: 0.997922/26 [========================>.....] - ETA: 0s - loss: 0.0156 - accuracy: 0.996725/26 [===========================>..] - ETA: 0s - loss: 0.0152 - accuracy: 0.996526/26 [==============================] - 1s 22ms/step - loss: 0.0155 - accuracy: 0.9966 - val_loss: 0.7313 - val_accuracy: 0.6859
Epoch 7/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0092 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0097 - accuracy: 0.9980 7/26 [=======>......................] - ETA: 0s - loss: 0.0166 - accuracy: 0.993310/26 [==========>...................] - ETA: 0s - loss: 0.0143 - accuracy: 0.995313/26 [==============>...............] - ETA: 0s - loss: 0.0133 - accuracy: 0.996316/26 [=================>............] - ETA: 0s - loss: 0.0133 - accuracy: 0.996019/26 [====================>.........] - ETA: 0s - loss: 0.0138 - accuracy: 0.996222/26 [========================>.....] - ETA: 0s - loss: 0.0139 - accuracy: 0.996425/26 [===========================>..] - ETA: 0s - loss: 0.0132 - accuracy: 0.996826/26 [==============================] - 1s 21ms/step - loss: 0.0129 - accuracy: 0.9970 - val_loss: 0.7629 - val_accuracy: 0.6477
Epoch 8/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0060 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0070 - accuracy: 0.9980 7/26 [=======>......................] - ETA: 0s - loss: 0.0109 - accuracy: 0.996710/26 [==========>...................] - ETA: 0s - loss: 0.0100 - accuracy: 0.996913/26 [==============>...............] - ETA: 0s - loss: 0.0104 - accuracy: 0.997016/26 [=================>............] - ETA: 0s - loss: 0.0093 - accuracy: 0.997620/26 [======================>.......] - ETA: 0s - loss: 0.0090 - accuracy: 0.997623/26 [=========================>....] - ETA: 0s - loss: 0.0085 - accuracy: 0.997926/26 [==============================] - ETA: 0s - loss: 0.0089 - accuracy: 0.997626/26 [==============================] - 1s 21ms/step - loss: 0.0089 - accuracy: 0.9976 - val_loss: 0.7877 - val_accuracy: 0.6813
Epoch 9/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0091 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0082 - accuracy: 1.0000 7/26 [=======>......................] - ETA: 0s - loss: 0.0115 - accuracy: 0.996710/26 [==========>...................] - ETA: 0s - loss: 0.0110 - accuracy: 0.996913/26 [==============>...............] - ETA: 0s - loss: 0.0099 - accuracy: 0.997616/26 [=================>............] - ETA: 0s - loss: 0.0097 - accuracy: 0.997619/26 [====================>.........] - ETA: 0s - loss: 0.0093 - accuracy: 0.997922/26 [========================>.....] - ETA: 0s - loss: 0.0090 - accuracy: 0.998225/26 [===========================>..] - ETA: 0s - loss: 0.0089 - accuracy: 0.998126/26 [==============================] - 1s 22ms/step - loss: 0.0087 - accuracy: 0.9982 - val_loss: 0.4859 - val_accuracy: 0.7754
Epoch 10/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0028 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0077 - accuracy: 0.9980 7/26 [=======>......................] - ETA: 0s - loss: 0.0053 - accuracy: 0.998910/26 [==========>...................] - ETA: 0s - loss: 0.0058 - accuracy: 0.998413/26 [==============>...............] - ETA: 0s - loss: 0.0078 - accuracy: 0.998216/26 [=================>............] - ETA: 0s - loss: 0.0070 - accuracy: 0.998520/26 [======================>.......] - ETA: 0s - loss: 0.0081 - accuracy: 0.997623/26 [=========================>....] - ETA: 0s - loss: 0.0080 - accuracy: 0.997626/26 [==============================] - ETA: 0s - loss: 0.0082 - accuracy: 0.997626/26 [==============================] - 1s 21ms/step - loss: 0.0082 - accuracy: 0.9976 - val_loss: 0.2006 - val_accuracy: 0.9171
 1/34 [..............................] - ETA: 1s26/34 [=====================>........] - ETA: 0s34/34 [==============================] - 0s 2ms/step
