Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 28, 28, 32)        320       
                                                                 
 batch_normalization (Batch  (None, 28, 28, 32)        128       
 Normalization)                                                  
                                                                 
 max_pooling2d (MaxPooling2  (None, 14, 14, 32)        0         
 D)                                                              
                                                                 
 conv2d_1 (Conv2D)           (None, 14, 14, 16)        4624      
                                                                 
 dropout (Dropout)           (None, 14, 14, 16)        0         
                                                                 
 batch_normalization_1 (Bat  (None, 14, 14, 16)        64        
 chNormalization)                                                
                                                                 
 max_pooling2d_1 (MaxPoolin  (None, 7, 7, 16)          0         
 g2D)                                                            
                                                                 
 conv2d_2 (Conv2D)           (None, 7, 7, 8)           1160      
                                                                 
 batch_normalization_2 (Bat  (None, 7, 7, 8)           32        
 chNormalization)                                                
                                                                 
 max_pooling2d_2 (MaxPoolin  (None, 4, 4, 8)           0         
 g2D)                                                            
                                                                 
 flatten (Flatten)           (None, 128)               0         
                                                                 
 dense (Dense)               (None, 128)               16512     
                                                                 
 dropout_1 (Dropout)         (None, 128)               0         
                                                                 
 dense_1 (Dense)             (None, 3)                 387       
                                                                 
=================================================================
Total params: 23227 (90.73 KB)
Trainable params: 23115 (90.29 KB)
Non-trainable params: 112 (448.00 Byte)
_________________________________________________________________
Epoch 1/10
 1/26 [>.............................] - ETA: 8s - loss: 1.7614 - accuracy: 0.2344 4/26 [===>..........................] - ETA: 0s - loss: 1.4419 - accuracy: 0.3535 7/26 [=======>......................] - ETA: 0s - loss: 1.2307 - accuracy: 0.445310/26 [==========>...................] - ETA: 0s - loss: 1.0976 - accuracy: 0.507813/26 [==============>...............] - ETA: 0s - loss: 0.9809 - accuracy: 0.566716/26 [=================>............] - ETA: 0s - loss: 0.8927 - accuracy: 0.608919/26 [====================>.........] - ETA: 0s - loss: 0.8150 - accuracy: 0.647622/26 [========================>.....] - ETA: 0s - loss: 0.7489 - accuracy: 0.679725/26 [===========================>..] - ETA: 0s - loss: 0.6971 - accuracy: 0.704626/26 [==============================] - 1s 25ms/step - loss: 0.6781 - accuracy: 0.7131 - val_loss: 1.0777 - val_accuracy: 0.3085
Epoch 2/10
 1/26 [>.............................] - ETA: 0s - loss: 0.2863 - accuracy: 0.9219 4/26 [===>..........................] - ETA: 0s - loss: 0.2401 - accuracy: 0.9310 7/26 [=======>......................] - ETA: 0s - loss: 0.2056 - accuracy: 0.938710/26 [==========>...................] - ETA: 0s - loss: 0.1913 - accuracy: 0.944013/26 [==============>...............] - ETA: 0s - loss: 0.1756 - accuracy: 0.948016/26 [=================>............] - ETA: 0s - loss: 0.1612 - accuracy: 0.952519/26 [====================>.........] - ETA: 0s - loss: 0.1500 - accuracy: 0.955522/26 [========================>.....] - ETA: 0s - loss: 0.1388 - accuracy: 0.958825/26 [===========================>..] - ETA: 0s - loss: 0.1319 - accuracy: 0.960726/26 [==============================] - 1s 21ms/step - loss: 0.1301 - accuracy: 0.9610 - val_loss: 1.0063 - val_accuracy: 0.4706
Epoch 3/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0487 - accuracy: 0.9922 5/26 [====>.........................] - ETA: 0s - loss: 0.0625 - accuracy: 0.9831 8/26 [========>.....................] - ETA: 0s - loss: 0.0593 - accuracy: 0.983611/26 [===========>..................] - ETA: 0s - loss: 0.0562 - accuracy: 0.983814/26 [===============>..............] - ETA: 0s - loss: 0.0543 - accuracy: 0.984517/26 [==================>...........] - ETA: 0s - loss: 0.0510 - accuracy: 0.986820/26 [======================>.......] - ETA: 0s - loss: 0.0518 - accuracy: 0.986923/26 [=========================>....] - ETA: 0s - loss: 0.0534 - accuracy: 0.985526/26 [==============================] - ETA: 0s - loss: 0.0521 - accuracy: 0.986326/26 [==============================] - 1s 20ms/step - loss: 0.0521 - accuracy: 0.9863 - val_loss: 0.9611 - val_accuracy: 0.7148
Epoch 4/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0660 - accuracy: 0.9844 4/26 [===>..........................] - ETA: 0s - loss: 0.0370 - accuracy: 0.9922 7/26 [=======>......................] - ETA: 0s - loss: 0.0453 - accuracy: 0.986610/26 [==========>...................] - ETA: 0s - loss: 0.0412 - accuracy: 0.988313/26 [==============>...............] - ETA: 0s - loss: 0.0379 - accuracy: 0.988617/26 [==================>...........] - ETA: 0s - loss: 0.0380 - accuracy: 0.987820/26 [======================>.......] - ETA: 0s - loss: 0.0362 - accuracy: 0.988923/26 [=========================>....] - ETA: 0s - loss: 0.0363 - accuracy: 0.988326/26 [==============================] - ETA: 0s - loss: 0.0345 - accuracy: 0.989026/26 [==============================] - 1s 21ms/step - loss: 0.0345 - accuracy: 0.9890 - val_loss: 0.8934 - val_accuracy: 0.7046
Epoch 5/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0625 - accuracy: 0.9766 4/26 [===>..........................] - ETA: 0s - loss: 0.0453 - accuracy: 0.9805 8/26 [========>.....................] - ETA: 0s - loss: 0.0347 - accuracy: 0.986711/26 [===========>..................] - ETA: 0s - loss: 0.0351 - accuracy: 0.988214/26 [===============>..............] - ETA: 0s - loss: 0.0327 - accuracy: 0.989117/26 [==================>...........] - ETA: 0s - loss: 0.0331 - accuracy: 0.987320/26 [======================>.......] - ETA: 0s - loss: 0.0317 - accuracy: 0.986923/26 [=========================>....] - ETA: 0s - loss: 0.0298 - accuracy: 0.988326/26 [==============================] - ETA: 0s - loss: 0.0295 - accuracy: 0.988726/26 [==============================] - 1s 21ms/step - loss: 0.0295 - accuracy: 0.9887 - val_loss: 0.8626 - val_accuracy: 0.6915
Epoch 6/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0108 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0110 - accuracy: 1.0000 7/26 [=======>......................] - ETA: 0s - loss: 0.0160 - accuracy: 0.997610/26 [==========>...................] - ETA: 0s - loss: 0.0178 - accuracy: 0.995113/26 [==============>...............] - ETA: 0s - loss: 0.0159 - accuracy: 0.996316/26 [=================>............] - ETA: 0s - loss: 0.0155 - accuracy: 0.996019/26 [====================>.........] - ETA: 0s - loss: 0.0152 - accuracy: 0.995822/26 [========================>.....] - ETA: 0s - loss: 0.0167 - accuracy: 0.994925/26 [===========================>..] - ETA: 0s - loss: 0.0159 - accuracy: 0.995226/26 [==============================] - 1s 22ms/step - loss: 0.0172 - accuracy: 0.9951 - val_loss: 0.7887 - val_accuracy: 0.6421
Epoch 7/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0097 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0059 - accuracy: 1.0000 7/26 [=======>......................] - ETA: 0s - loss: 0.0182 - accuracy: 0.995510/26 [==========>...................] - ETA: 0s - loss: 0.0162 - accuracy: 0.996113/26 [==============>...............] - ETA: 0s - loss: 0.0149 - accuracy: 0.997016/26 [=================>............] - ETA: 0s - loss: 0.0134 - accuracy: 0.997619/26 [====================>.........] - ETA: 0s - loss: 0.0171 - accuracy: 0.995922/26 [========================>.....] - ETA: 0s - loss: 0.0174 - accuracy: 0.996125/26 [===========================>..] - ETA: 0s - loss: 0.0166 - accuracy: 0.996226/26 [==============================] - 1s 22ms/step - loss: 0.0165 - accuracy: 0.9960 - val_loss: 0.7165 - val_accuracy: 0.6729
Epoch 8/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0122 - accuracy: 0.9922 4/26 [===>..........................] - ETA: 0s - loss: 0.0085 - accuracy: 0.9980 7/26 [=======>......................] - ETA: 0s - loss: 0.0081 - accuracy: 0.998910/26 [==========>...................] - ETA: 0s - loss: 0.0085 - accuracy: 0.999213/26 [==============>...............] - ETA: 0s - loss: 0.0076 - accuracy: 0.999416/26 [=================>............] - ETA: 0s - loss: 0.0082 - accuracy: 0.998019/26 [====================>.........] - ETA: 0s - loss: 0.0085 - accuracy: 0.997922/26 [========================>.....] - ETA: 0s - loss: 0.0086 - accuracy: 0.997825/26 [===========================>..] - ETA: 0s - loss: 0.0095 - accuracy: 0.996826/26 [==============================] - 1s 24ms/step - loss: 0.0095 - accuracy: 0.9970 - val_loss: 0.6050 - val_accuracy: 0.7484
Epoch 9/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0025 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0181 - accuracy: 0.9902 7/26 [=======>......................] - ETA: 0s - loss: 0.0148 - accuracy: 0.992210/26 [==========>...................] - ETA: 0s - loss: 0.0119 - accuracy: 0.994313/26 [==============>...............] - ETA: 0s - loss: 0.0103 - accuracy: 0.995716/26 [=================>............] - ETA: 0s - loss: 0.0109 - accuracy: 0.995519/26 [====================>.........] - ETA: 0s - loss: 0.0099 - accuracy: 0.996222/26 [========================>.....] - ETA: 0s - loss: 0.0091 - accuracy: 0.996725/26 [===========================>..] - ETA: 0s - loss: 0.0094 - accuracy: 0.996526/26 [==============================] - 1s 24ms/step - loss: 0.0103 - accuracy: 0.9963 - val_loss: 0.5110 - val_accuracy: 0.7633
Epoch 10/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0107 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0090 - accuracy: 0.9980 7/26 [=======>......................] - ETA: 0s - loss: 0.0067 - accuracy: 0.998910/26 [==========>...................] - ETA: 0s - loss: 0.0102 - accuracy: 0.997713/26 [==============>...............] - ETA: 0s - loss: 0.0098 - accuracy: 0.997616/26 [=================>............] - ETA: 0s - loss: 0.0092 - accuracy: 0.997619/26 [====================>.........] - ETA: 0s - loss: 0.0088 - accuracy: 0.997922/26 [========================>.....] - ETA: 0s - loss: 0.0080 - accuracy: 0.998225/26 [===========================>..] - ETA: 0s - loss: 0.0078 - accuracy: 0.998126/26 [==============================] - 1s 22ms/step - loss: 0.0079 - accuracy: 0.9979 - val_loss: 0.3395 - val_accuracy: 0.8835
 1/34 [..............................] - ETA: 1s27/34 [======================>.......] - ETA: 0s34/34 [==============================] - 0s 2ms/step
