Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 28, 28, 32)        320       
                                                                 
 batch_normalization (Batch  (None, 28, 28, 32)        128       
 Normalization)                                                  
                                                                 
 max_pooling2d (MaxPooling2  (None, 14, 14, 32)        0         
 D)                                                              
                                                                 
 conv2d_1 (Conv2D)           (None, 14, 14, 16)        4624      
                                                                 
 dropout (Dropout)           (None, 14, 14, 16)        0         
                                                                 
 batch_normalization_1 (Bat  (None, 14, 14, 16)        64        
 chNormalization)                                                
                                                                 
 max_pooling2d_1 (MaxPoolin  (None, 7, 7, 16)          0         
 g2D)                                                            
                                                                 
 conv2d_2 (Conv2D)           (None, 7, 7, 8)           1160      
                                                                 
 batch_normalization_2 (Bat  (None, 7, 7, 8)           32        
 chNormalization)                                                
                                                                 
 max_pooling2d_2 (MaxPoolin  (None, 4, 4, 8)           0         
 g2D)                                                            
                                                                 
 flatten (Flatten)           (None, 128)               0         
                                                                 
 dense (Dense)               (None, 128)               16512     
                                                                 
 dropout_1 (Dropout)         (None, 128)               0         
                                                                 
 dense_1 (Dense)             (None, 3)                 387       
                                                                 
=================================================================
Total params: 23227 (90.73 KB)
Trainable params: 23115 (90.29 KB)
Non-trainable params: 112 (448.00 Byte)
_________________________________________________________________
Epoch 1/10
 1/26 [>.............................] - ETA: 8s - loss: 2.5108 - accuracy: 0.3047 4/26 [===>..........................] - ETA: 0s - loss: 1.6727 - accuracy: 0.3887 7/26 [=======>......................] - ETA: 0s - loss: 1.4289 - accuracy: 0.443110/26 [==========>...................] - ETA: 0s - loss: 1.2662 - accuracy: 0.492213/26 [==============>...............] - ETA: 0s - loss: 1.1540 - accuracy: 0.532516/26 [=================>............] - ETA: 0s - loss: 1.0584 - accuracy: 0.564919/26 [====================>.........] - ETA: 0s - loss: 0.9865 - accuracy: 0.595822/26 [========================>.....] - ETA: 0s - loss: 0.9230 - accuracy: 0.621425/26 [===========================>..] - ETA: 0s - loss: 0.8675 - accuracy: 0.644426/26 [==============================] - 1s 30ms/step - loss: 0.8501 - accuracy: 0.6515 - val_loss: 1.1810 - val_accuracy: 0.4026
Epoch 2/10
 1/26 [>.............................] - ETA: 0s - loss: 0.3728 - accuracy: 0.8359 4/26 [===>..........................] - ETA: 0s - loss: 0.3583 - accuracy: 0.8438 7/26 [=======>......................] - ETA: 0s - loss: 0.3402 - accuracy: 0.866110/26 [==========>...................] - ETA: 0s - loss: 0.3228 - accuracy: 0.875013/26 [==============>...............] - ETA: 0s - loss: 0.3142 - accuracy: 0.880416/26 [=================>............] - ETA: 0s - loss: 0.3024 - accuracy: 0.887219/26 [====================>.........] - ETA: 0s - loss: 0.2907 - accuracy: 0.891822/26 [========================>.....] - ETA: 0s - loss: 0.2784 - accuracy: 0.896725/26 [===========================>..] - ETA: 0s - loss: 0.2642 - accuracy: 0.903226/26 [==============================] - 1s 26ms/step - loss: 0.2600 - accuracy: 0.9061 - val_loss: 1.2669 - val_accuracy: 0.5536
Epoch 3/10
 1/26 [>.............................] - ETA: 0s - loss: 0.1809 - accuracy: 0.9531 4/26 [===>..........................] - ETA: 0s - loss: 0.1563 - accuracy: 0.9551 7/26 [=======>......................] - ETA: 0s - loss: 0.1383 - accuracy: 0.960910/26 [==========>...................] - ETA: 0s - loss: 0.1324 - accuracy: 0.961013/26 [==============>...............] - ETA: 0s - loss: 0.1238 - accuracy: 0.965316/26 [=================>............] - ETA: 0s - loss: 0.1179 - accuracy: 0.967519/26 [====================>.........] - ETA: 0s - loss: 0.1185 - accuracy: 0.967322/26 [========================>.....] - ETA: 0s - loss: 0.1136 - accuracy: 0.968625/26 [===========================>..] - ETA: 0s - loss: 0.1106 - accuracy: 0.970526/26 [==============================] - 1s 26ms/step - loss: 0.1094 - accuracy: 0.9704 - val_loss: 1.2824 - val_accuracy: 0.4026
Epoch 4/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0662 - accuracy: 0.9766 4/26 [===>..........................] - ETA: 0s - loss: 0.0818 - accuracy: 0.9746 7/26 [=======>......................] - ETA: 0s - loss: 0.0689 - accuracy: 0.983310/26 [==========>...................] - ETA: 0s - loss: 0.0672 - accuracy: 0.982813/26 [==============>...............] - ETA: 0s - loss: 0.0646 - accuracy: 0.983216/26 [=================>............] - ETA: 0s - loss: 0.0642 - accuracy: 0.983019/26 [====================>.........] - ETA: 0s - loss: 0.0632 - accuracy: 0.982822/26 [========================>.....] - ETA: 0s - loss: 0.0603 - accuracy: 0.984125/26 [===========================>..] - ETA: 0s - loss: 0.0625 - accuracy: 0.983526/26 [==============================] - 1s 26ms/step - loss: 0.0637 - accuracy: 0.9832 - val_loss: 1.3374 - val_accuracy: 0.4026
Epoch 5/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0361 - accuracy: 0.9922 4/26 [===>..........................] - ETA: 0s - loss: 0.0496 - accuracy: 0.9863 7/26 [=======>......................] - ETA: 0s - loss: 0.0601 - accuracy: 0.981010/26 [==========>...................] - ETA: 0s - loss: 0.0540 - accuracy: 0.983813/26 [==============>...............] - ETA: 0s - loss: 0.0477 - accuracy: 0.986416/26 [=================>............] - ETA: 0s - loss: 0.0464 - accuracy: 0.986519/26 [====================>.........] - ETA: 0s - loss: 0.0481 - accuracy: 0.986222/26 [========================>.....] - ETA: 0s - loss: 0.0464 - accuracy: 0.985925/26 [===========================>..] - ETA: 0s - loss: 0.0445 - accuracy: 0.986726/26 [==============================] - 1s 26ms/step - loss: 0.0439 - accuracy: 0.9866 - val_loss: 1.4639 - val_accuracy: 0.4026
Epoch 6/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0237 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0205 - accuracy: 0.9980 7/26 [=======>......................] - ETA: 0s - loss: 0.0244 - accuracy: 0.994410/26 [==========>...................] - ETA: 0s - loss: 0.0269 - accuracy: 0.992213/26 [==============>...............] - ETA: 0s - loss: 0.0287 - accuracy: 0.991616/26 [=================>............] - ETA: 0s - loss: 0.0290 - accuracy: 0.991219/26 [====================>.........] - ETA: 0s - loss: 0.0294 - accuracy: 0.991422/26 [========================>.....] - ETA: 0s - loss: 0.0288 - accuracy: 0.991725/26 [===========================>..] - ETA: 0s - loss: 0.0296 - accuracy: 0.991126/26 [==============================] - 1s 27ms/step - loss: 0.0294 - accuracy: 0.9915 - val_loss: 1.6703 - val_accuracy: 0.4026
Epoch 7/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0247 - accuracy: 0.9922 4/26 [===>..........................] - ETA: 0s - loss: 0.0197 - accuracy: 0.9961 7/26 [=======>......................] - ETA: 0s - loss: 0.0167 - accuracy: 0.997810/26 [==========>...................] - ETA: 0s - loss: 0.0150 - accuracy: 0.997713/26 [==============>...............] - ETA: 0s - loss: 0.0147 - accuracy: 0.998216/26 [=================>............] - ETA: 0s - loss: 0.0178 - accuracy: 0.997119/26 [====================>.........] - ETA: 0s - loss: 0.0200 - accuracy: 0.995922/26 [========================>.....] - ETA: 0s - loss: 0.0196 - accuracy: 0.995725/26 [===========================>..] - ETA: 0s - loss: 0.0196 - accuracy: 0.995626/26 [==============================] - 1s 27ms/step - loss: 0.0208 - accuracy: 0.9948 - val_loss: 1.8332 - val_accuracy: 0.4026
Epoch 8/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0154 - accuracy: 0.9922 4/26 [===>..........................] - ETA: 0s - loss: 0.0199 - accuracy: 0.9961 7/26 [=======>......................] - ETA: 0s - loss: 0.0188 - accuracy: 0.996710/26 [==========>...................] - ETA: 0s - loss: 0.0248 - accuracy: 0.996113/26 [==============>...............] - ETA: 0s - loss: 0.0256 - accuracy: 0.995216/26 [=================>............] - ETA: 0s - loss: 0.0264 - accuracy: 0.994619/26 [====================>.........] - ETA: 0s - loss: 0.0242 - accuracy: 0.995122/26 [========================>.....] - ETA: 0s - loss: 0.0229 - accuracy: 0.995325/26 [===========================>..] - ETA: 0s - loss: 0.0213 - accuracy: 0.995926/26 [==============================] - 1s 27ms/step - loss: 0.0208 - accuracy: 0.9960 - val_loss: 1.9217 - val_accuracy: 0.4026
Epoch 9/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0085 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0168 - accuracy: 0.9961 7/26 [=======>......................] - ETA: 0s - loss: 0.0147 - accuracy: 0.997810/26 [==========>...................] - ETA: 0s - loss: 0.0145 - accuracy: 0.998413/26 [==============>...............] - ETA: 0s - loss: 0.0128 - accuracy: 0.998816/26 [=================>............] - ETA: 0s - loss: 0.0133 - accuracy: 0.998519/26 [====================>.........] - ETA: 0s - loss: 0.0136 - accuracy: 0.997122/26 [========================>.....] - ETA: 0s - loss: 0.0135 - accuracy: 0.997125/26 [===========================>..] - ETA: 0s - loss: 0.0127 - accuracy: 0.997526/26 [==============================] - 1s 27ms/step - loss: 0.0126 - accuracy: 0.9976 - val_loss: 1.8786 - val_accuracy: 0.4026
Epoch 10/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0101 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0060 - accuracy: 1.0000 7/26 [=======>......................] - ETA: 0s - loss: 0.0086 - accuracy: 0.998910/26 [==========>...................] - ETA: 0s - loss: 0.0092 - accuracy: 0.998413/26 [==============>...............] - ETA: 0s - loss: 0.0108 - accuracy: 0.997016/26 [=================>............] - ETA: 0s - loss: 0.0102 - accuracy: 0.997119/26 [====================>.........] - ETA: 0s - loss: 0.0098 - accuracy: 0.997122/26 [========================>.....] - ETA: 0s - loss: 0.0097 - accuracy: 0.997125/26 [===========================>..] - ETA: 0s - loss: 0.0097 - accuracy: 0.996826/26 [==============================] - 1s 27ms/step - loss: 0.0095 - accuracy: 0.9970 - val_loss: 1.8129 - val_accuracy: 0.4026
 1/34 [..............................] - ETA: 1s18/34 [==============>...............] - ETA: 0s34/34 [==============================] - 0s 3ms/step
