Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 28, 28, 32)        320       
                                                                 
 batch_normalization (Batch  (None, 28, 28, 32)        128       
 Normalization)                                                  
                                                                 
 max_pooling2d (MaxPooling2  (None, 14, 14, 32)        0         
 D)                                                              
                                                                 
 conv2d_1 (Conv2D)           (None, 14, 14, 16)        4624      
                                                                 
 dropout (Dropout)           (None, 14, 14, 16)        0         
                                                                 
 batch_normalization_1 (Bat  (None, 14, 14, 16)        64        
 chNormalization)                                                
                                                                 
 max_pooling2d_1 (MaxPoolin  (None, 7, 7, 16)          0         
 g2D)                                                            
                                                                 
 conv2d_2 (Conv2D)           (None, 7, 7, 8)           1160      
                                                                 
 batch_normalization_2 (Bat  (None, 7, 7, 8)           32        
 chNormalization)                                                
                                                                 
 max_pooling2d_2 (MaxPoolin  (None, 4, 4, 8)           0         
 g2D)                                                            
                                                                 
 flatten (Flatten)           (None, 128)               0         
                                                                 
 dense (Dense)               (None, 128)               16512     
                                                                 
 dropout_1 (Dropout)         (None, 128)               0         
                                                                 
 dense_1 (Dense)             (None, 3)                 387       
                                                                 
=================================================================
Total params: 23227 (90.73 KB)
Trainable params: 23115 (90.29 KB)
Non-trainable params: 112 (448.00 Byte)
_________________________________________________________________
Epoch 1/10
 1/26 [>.............................] - ETA: 8s - loss: 1.5029 - accuracy: 0.3500 4/26 [===>..........................] - ETA: 0s - loss: 1.2081 - accuracy: 0.4547 7/26 [=======>......................] - ETA: 0s - loss: 1.0264 - accuracy: 0.540110/26 [==========>...................] - ETA: 0s - loss: 0.8925 - accuracy: 0.612813/26 [==============>...............] - ETA: 0s - loss: 0.7692 - accuracy: 0.676416/26 [=================>............] - ETA: 0s - loss: 0.6806 - accuracy: 0.717519/26 [====================>.........] - ETA: 0s - loss: 0.6156 - accuracy: 0.746222/26 [========================>.....] - ETA: 0s - loss: 0.5613 - accuracy: 0.770225/26 [===========================>..] - ETA: 0s - loss: 0.5151 - accuracy: 0.790626/26 [==============================] - 1s 26ms/step - loss: 0.4996 - accuracy: 0.7976 - val_loss: 0.8648 - val_accuracy: 0.4809
Epoch 2/10
 1/26 [>.............................] - ETA: 0s - loss: 0.1702 - accuracy: 0.9297 4/26 [===>..........................] - ETA: 0s - loss: 0.1606 - accuracy: 0.9414 7/26 [=======>......................] - ETA: 0s - loss: 0.1487 - accuracy: 0.947510/26 [==========>...................] - ETA: 0s - loss: 0.1276 - accuracy: 0.957013/26 [==============>...............] - ETA: 0s - loss: 0.1175 - accuracy: 0.962716/26 [=================>............] - ETA: 0s - loss: 0.1126 - accuracy: 0.963919/26 [====================>.........] - ETA: 0s - loss: 0.1046 - accuracy: 0.965922/26 [========================>.....] - ETA: 0s - loss: 0.0973 - accuracy: 0.968425/26 [===========================>..] - ETA: 0s - loss: 0.0923 - accuracy: 0.970326/26 [==============================] - 1s 22ms/step - loss: 0.0906 - accuracy: 0.9710 - val_loss: 0.8146 - val_accuracy: 0.4212
Epoch 3/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0525 - accuracy: 0.9922 4/26 [===>..........................] - ETA: 0s - loss: 0.0446 - accuracy: 0.9863 7/26 [=======>......................] - ETA: 0s - loss: 0.0387 - accuracy: 0.990010/26 [==========>...................] - ETA: 0s - loss: 0.0430 - accuracy: 0.986713/26 [==============>...............] - ETA: 0s - loss: 0.0433 - accuracy: 0.987416/26 [=================>............] - ETA: 0s - loss: 0.0413 - accuracy: 0.988819/26 [====================>.........] - ETA: 0s - loss: 0.0399 - accuracy: 0.989122/26 [========================>.....] - ETA: 0s - loss: 0.0400 - accuracy: 0.988825/26 [===========================>..] - ETA: 0s - loss: 0.0391 - accuracy: 0.988926/26 [==============================] - 1s 22ms/step - loss: 0.0397 - accuracy: 0.9887 - val_loss: 0.9059 - val_accuracy: 0.4026
Epoch 4/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0166 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0327 - accuracy: 0.9883 7/26 [=======>......................] - ETA: 0s - loss: 0.0292 - accuracy: 0.992210/26 [==========>...................] - ETA: 0s - loss: 0.0289 - accuracy: 0.989813/26 [==============>...............] - ETA: 0s - loss: 0.0277 - accuracy: 0.991616/26 [=================>............] - ETA: 0s - loss: 0.0278 - accuracy: 0.992219/26 [====================>.........] - ETA: 0s - loss: 0.0289 - accuracy: 0.992622/26 [========================>.....] - ETA: 0s - loss: 0.0278 - accuracy: 0.993125/26 [===========================>..] - ETA: 0s - loss: 0.0265 - accuracy: 0.993726/26 [==============================] - 1s 22ms/step - loss: 0.0261 - accuracy: 0.9939 - val_loss: 0.9652 - val_accuracy: 0.4026
Epoch 5/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0167 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0180 - accuracy: 0.9961 7/26 [=======>......................] - ETA: 0s - loss: 0.0183 - accuracy: 0.995510/26 [==========>...................] - ETA: 0s - loss: 0.0174 - accuracy: 0.995313/26 [==============>...............] - ETA: 0s - loss: 0.0162 - accuracy: 0.996416/26 [=================>............] - ETA: 0s - loss: 0.0163 - accuracy: 0.996119/26 [====================>.........] - ETA: 0s - loss: 0.0170 - accuracy: 0.995922/26 [========================>.....] - ETA: 0s - loss: 0.0177 - accuracy: 0.995425/26 [===========================>..] - ETA: 0s - loss: 0.0183 - accuracy: 0.995226/26 [==============================] - 1s 22ms/step - loss: 0.0179 - accuracy: 0.9954 - val_loss: 0.9596 - val_accuracy: 0.4054
Epoch 6/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0066 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0242 - accuracy: 0.9922 7/26 [=======>......................] - ETA: 0s - loss: 0.0209 - accuracy: 0.992910/26 [==========>...................] - ETA: 0s - loss: 0.0216 - accuracy: 0.992713/26 [==============>...............] - ETA: 0s - loss: 0.0187 - accuracy: 0.994416/26 [=================>............] - ETA: 0s - loss: 0.0181 - accuracy: 0.994519/26 [====================>.........] - ETA: 0s - loss: 0.0167 - accuracy: 0.995422/26 [========================>.....] - ETA: 0s - loss: 0.0161 - accuracy: 0.995325/26 [===========================>..] - ETA: 0s - loss: 0.0172 - accuracy: 0.994626/26 [==============================] - 1s 22ms/step - loss: 0.0171 - accuracy: 0.9945 - val_loss: 0.9098 - val_accuracy: 0.4203
Epoch 7/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0132 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0083 - accuracy: 1.0000 7/26 [=======>......................] - ETA: 0s - loss: 0.0085 - accuracy: 0.998910/26 [==========>...................] - ETA: 0s - loss: 0.0079 - accuracy: 0.998413/26 [==============>...............] - ETA: 0s - loss: 0.0083 - accuracy: 0.998816/26 [=================>............] - ETA: 0s - loss: 0.0102 - accuracy: 0.998019/26 [====================>.........] - ETA: 0s - loss: 0.0099 - accuracy: 0.998422/26 [========================>.....] - ETA: 0s - loss: 0.0093 - accuracy: 0.998625/26 [===========================>..] - ETA: 0s - loss: 0.0092 - accuracy: 0.998726/26 [==============================] - 1s 23ms/step - loss: 0.0091 - accuracy: 0.9988 - val_loss: 0.9023 - val_accuracy: 0.4408
Epoch 8/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0024 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0101 - accuracy: 0.9980 7/26 [=======>......................] - ETA: 0s - loss: 0.0089 - accuracy: 0.998810/26 [==========>...................] - ETA: 0s - loss: 0.0083 - accuracy: 0.998413/26 [==============>...............] - ETA: 0s - loss: 0.0091 - accuracy: 0.998116/26 [=================>............] - ETA: 0s - loss: 0.0095 - accuracy: 0.998019/26 [====================>.........] - ETA: 0s - loss: 0.0087 - accuracy: 0.998322/26 [========================>.....] - ETA: 0s - loss: 0.0085 - accuracy: 0.998225/26 [===========================>..] - ETA: 0s - loss: 0.0078 - accuracy: 0.998426/26 [==============================] - 1s 22ms/step - loss: 0.0085 - accuracy: 0.9979 - val_loss: 0.6708 - val_accuracy: 0.5527
Epoch 9/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0022 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0051 - accuracy: 1.0000 7/26 [=======>......................] - ETA: 0s - loss: 0.0067 - accuracy: 1.000010/26 [==========>...................] - ETA: 0s - loss: 0.0057 - accuracy: 1.000013/26 [==============>...............] - ETA: 0s - loss: 0.0050 - accuracy: 1.000016/26 [=================>............] - ETA: 0s - loss: 0.0067 - accuracy: 0.999019/26 [====================>.........] - ETA: 0s - loss: 0.0059 - accuracy: 0.999222/26 [========================>.....] - ETA: 0s - loss: 0.0056 - accuracy: 0.999325/26 [===========================>..] - ETA: 0s - loss: 0.0055 - accuracy: 0.999426/26 [==============================] - 1s 22ms/step - loss: 0.0056 - accuracy: 0.9991 - val_loss: 0.5600 - val_accuracy: 0.6626
Epoch 10/10
 1/26 [>.............................] - ETA: 0s - loss: 0.0014 - accuracy: 1.0000 4/26 [===>..........................] - ETA: 0s - loss: 0.0038 - accuracy: 1.0000 7/26 [=======>......................] - ETA: 0s - loss: 0.0036 - accuracy: 1.000010/26 [==========>...................] - ETA: 0s - loss: 0.0040 - accuracy: 0.999213/26 [==============>...............] - ETA: 0s - loss: 0.0039 - accuracy: 0.999416/26 [=================>............] - ETA: 0s - loss: 0.0042 - accuracy: 0.999519/26 [====================>.........] - ETA: 0s - loss: 0.0044 - accuracy: 0.999622/26 [========================>.....] - ETA: 0s - loss: 0.0045 - accuracy: 0.999625/26 [===========================>..] - ETA: 0s - loss: 0.0044 - accuracy: 0.999726/26 [==============================] - 1s 22ms/step - loss: 0.0044 - accuracy: 0.9997 - val_loss: 0.3969 - val_accuracy: 0.7605
 1/34 [..............................] - ETA: 1s25/34 [=====================>........] - ETA: 0s34/34 [==============================] - 0s 2ms/step
